{"_type": "service", "title": "Design", "slug": { "_type": "slug", "current": "design" }, "description": "Our in-house artisans craft visual identities that perfectly resonate with your core values.", "items": ["Logo Design", "Branding", "Illustration"], "detailHeroTitle": "A Design Studio creating Visual Vibes.", "detailHeroDescriptionLead": "We combine creative intuition with artistic expertise to build brands that matter.", "detailHeroDescription": "From logo creation to full brand guidelines, we ensure every pixel communicates your story. Our design process is collaborative, iterative, and focused on finding the unique soul of your business.", "approachTitle": "Different by Design", "approachText": "We don’t follow trends; we set them. Your brand needs to stand out, not blend in. We analyze your market position and craft a visual language that is distinctly yours.", "capabilities": ["Logo Design", "Brand Identity", "Illustration", "Art Direction", "Motion Graphics"]}
{"_type": "service", "title": "Develop", "slug": { "_type": "slug", "current": "develop" }, "description": "Engineering robust digital platforms that meet the highest industry standards and performance metrics.", "items": ["Website Creation (Design & Development)"], "detailHeroTitle": "Engineering Digital Excellence.", "detailHeroDescriptionLead": "Code that performs as beautifully as it looks. We build scalable, fast, and secure web solutions.", "detailHeroDescription": "Our development team masters modern tech stacks to deliver websites that are not just pretty faces but powerful engines for your business logic. We prioritize performance, accessibility, and SEO from the first line of code.", "approachTitle": "Built to Scale", "approachText": "We build with the future in mind. Whether you need a simple landing page or a complex web application, our architecture is designed to grow with your business.", "capabilities": ["Frontend Development", "Backend Development", "CMS Integration", "E-commerce", "Performance Optimization"]}
{"_type": "service", "title": "Support", "slug": { "_type": "slug", "current": "support" }, "description": "Reliable ongoing partnership for your design, technical, and growth marketing requirements.", "items": ["Instagram Posts", "LinkedIn Posts", "Maintenance"], "detailHeroTitle": "Growth & Maintenance Partners.", "detailHeroDescriptionLead": "We don't just launch and leave. We are your long-term digital partners.", "detailHeroDescription": "Digital products need care. We provide ongoing support, content creation, and technical maintenance to ensure your digital presence remains fresh, secure, and effective.", "approachTitle": "Always On", "approachText": "Your business never stops, and neither do we. Our support packages are designed to give you peace of mind and continuous improvement.", "capabilities": ["Social Media Content", "Technical Maintenance", "Analytics & Reporting", "Security Updates", "Consulting"]}
{"_type": "team", "name": "Joe", "role": "Web Developer", "linkedin": "https://linkedin.com"}
{"_type": "team", "name": "Chris", "role": "Accounts & Finance", "linkedin": "https://linkedin.com"}
{"_type": "team", "name": "Ruby", "role": "Design Intern", "linkedin": "https://linkedin.com"}
{"_type": "team", "name": "Dipper", "role": "Chief Barker", "linkedin": "https://linkedin.com"}
{"_type": "team", "name": "Alex", "role": "Founder", "linkedin": "https://linkedin.com"}
{"_type": "team", "name": "Sarah", "role": "Lead Designer", "linkedin": "https://linkedin.com"}
{"_type": "testimonial", "name": "Daniel Poll", "company": "Noramble", "initial": "D", "text": "I've been working with Andy and the Vibe team for around 12 months now. They've been nothing shy of perfect. The team completely designed and rebuilt my website using modern tech which has been such a positive change against my old website. Can't recommend Vibe enough"}
{"_type": "testimonial", "name": "Sarah Jenks", "company": "TechFlow", "initial": "S", "text": "The level of creativity and attention to detail Vibe brings to the table is unmatched. They didn't just build a website; they crafted an experience that perfectly represents our brand values. The process was seamless from start to finish."}
{"_type": "testimonial", "name": "Mike Ross", "company": "Innovate", "initial": "M", "text": "Working with Vibe was a game-changer for our startup. They understood our vision immediately and translated it into a digital product that exceeds our expectations. The team is responsive, talented, and truly cares about the outcome."}
